[
  {
            "id": "s01",
            "type": "Contract Law",
            "scenario": "Alan needed money quickly. He owned an original 1886 edition of Kidnapped by Robert Louis Stevenson, a book which he advertised in the newspaper for sale for $1000. Cate saw the advertisement. She telephoned Alan, saying that she would buy the book for $1000. Alan, however, replied that he had reconsidered the matter and that he could not sell the book for less than $2000.Cate replied that she would give him $1500. Alan replied that he would only sell the book for $2000 but that he would keep his offer open for seven days.He also said that Cate could fax her acceptance to him if she wanted.The next day Alan sold the book to his friend David because David loved the book so much and because he paid $7000 for it. Two days later Cate decided to purchase the book for Alan's price of $2000.She posted her acceptance to Alan.The next day David told Cate that he had bought a copy of Kidnapped from Alan for $7, 000. Cate rang Alan to confirm that she had accepted his offer.Later that day Alan received Cate's acceptance.",
            "issue": "whether there is a valid contract between Alan and Cate",
            "dceompose question": "1. Was the advertisement put out by Alan an invitation to treat or an offer\n2.  Whether Alan has accepted Cate's offer to buy the book at 1000\n3. Whether Alan is bound to keep his offer open for 7 days\n4. Whether there is valid acceptance by Cate for Alan's offer to sell at 2000\n",
            "analysis": "(1) According to {Eckhardt Marine GmbH v Sheriff, High Court of Malaya, Seremban (2001) 4 MLJ 49[]} THEN Alan's advertisement to sell the book for $1000 is an invitation to treat {LEGALLIZATION}\n(2) IF Alan's advertisement to sell the book for $1000 is an invitation to treat THEN Cate's reply to buy the book for $ 1000 is an offer. {Section 4.1} {LEGALLIZATION}\n(3) Alan's reply saying that he could not sell the book for less than $2000 is not an acceptance because acceptance must be absolute and unqualified.{Section 7a} {LEGALLIZATION} {AND} since Alan changed the price from $1500 to $2000, he made a counter offer which in effect destroyed Cate's original offer {Malayan Flour Mills Bhd v Saw Eng Chee (Administrator of the estate of Saw Cheng Chor, decd) (1997) 1 MLJ 763. []}{LEGALLIZATION}\n(4) Cate's reply to buy at $1500 is also a counter offer {CO-REFERENCE (3)}\n(5) Alan did not accept Cate's counter offer but he made another counter offer that he would only sell the book for $2000 {AND} he would keep his offer open for seven days.[TKN1]  {CO-REFERENCE(3)}\n(6) IF acceptance is made by post THEN it takes effect upon posting  {Adams v Lindsell (1818) 1 B & Ald 681[]} {LEGALLIZATION}\n(7) {HOWEVER} Alan's offer has a specification of mode of offer therefore postal rule does not apply {AND} Cate's acceptance is invalid {Section 7b} {LEGALLIZATION}\n(8) IF Cate's acceptance is not valid THEN Alan can revoke his offer {Section 5.1}{LEGALLIZATION}\n(9) {HOWEVER} revocation only takes effect when it is communicated to Cate {Section 6a} {LEGALLIZATION}\n(10) ACCORDING TO {Section 6a}, revocation has to be made by the offeror, IF revocation has been communicated by David who is a third party THEN revocation is invalid.\n(11) IF revocation invalid THEN Cate can still accept the offer. \n(12) SINCE Cate has rang Alan to confirm her acceptance THEN her acceptance is communicated. {Section 2}\n(13) IF (12) THEN there is a valid contract between Alan and Cate \n",
            "conclusion": "yes, there is a valid contract between Alan and Cate"
        },
  {
            "id": "s02",
            "type": "Contract Law",
            "scenario": "Ellie's Montblanc pen with her name engraved on it was stolen. She puts an advertisement on her personal blog advertising a reward of RM1,000 to anyone who finds it. Frank, who has not seen the advertisement, discovers the pen in a library locker and takes it home. His course mate, Galvin, on seeing the pen, recognizes it as the one for which the reward has been offered, and shows Frank the advertisement in Ellie's blog. Frank returns the pen to Ellie, but she refuses to pay RM 1,000, saying that the offer has been withdrawn. Frank knows that Galvin has been keen to buy his vintage Vespa scooter.On Sunday he tells Galvin that he has decided to sell at RM 5, 000.Galvin says that he is very interested but would like to think about it.Frank says 'I will assume that you want it, unless you tell me otherwise by Friday'.On Thursday, Galvin meets Hassan who tells him that Frank has just agreed to sell the scooter to Jaya for RM6, 000.Galvin immediately texted Frank accepting his offer.Later that day, however, Galvin changes his mind and calls on Frank to tell him to ignore the text message.Frank tells him that his deal with Jaya has fallen through, and he is still keen to sell it to Galvin.",
            "issue": " whether there is a contract between Ellie and Frank, Frank and Galvin. \n",
            "dceompose question": "1. whether Ellie's advertisement is an invitation to treat or an offer \n2. whether Frank has accepted Ellie's offer\n3. Whether there is valid revocation of offer by Ellie\n4. whether Galvin has accepted Frank's offer? \n5. Could Frank communicate his revocation of offer through third party? \n6. Could Galvin revoke his acceptance after sending the text? \n",
            "analysis": "(1) According to {Eckhardt Marine GmbH v Sheriff (2001)4 MLJ 49[53-54]}, IF {Ellie[offeror]}{puts an advertisement[offer]} THEN it is not an offer but an invitation to treat. \n(2) {HOWEVER} according to {Carlill v Carbolic Smoke Ball Co[1893] 1 QB 256[262]}, IF {Ellie[offeror]} put out an advertisement {advertising a reward of RM1,000 to anyone who finds it[promising reward upon performance of conditions]} to the public THEN it is an offer. \n(3) According to {Section 3}{AND}{Section 8}, {Frank[offeree]} can communicate his acceptance by actions. \n(4) IF {Frank[offeree]} {returns the pen[performance of stated conditions]} THEN he has accepted the offer. {Carlill v Carbolic Smoke Ball Co[1893] 1 QB 256[262]} \n(5) {HOWEVER} a contract requires a meeting of mind.{Section 13}. \n(6) IF {Frank[offeree]}{has not seen the advertisement[ignorant to offer]}  {AND} {Frank[offeree]} {returns the pen[performance of stated conditions]} without knowledge THEN there is no meeting of mind. {Inland Revenue Commissioners v Fry [2001] All ER (D) 434 (Nov)[2-3]}\n(7) IF there is no meeting of mind THEN there is no acceptance. \n(8) {HOWEVER} when {Frank[offeree]}{returns the pen[performance of stated conditions]}, he had knowledge of the offer because his friend {shows Frank the advertisement in Ellie s blog[knowledge of the offer]}. \n(9) IF {Frank[offeree]} has knowledge THEN there is a meeting of mind. \n(10) IF there is a meeting of mind THEN there is valid acceptance. \n(11) According to {Section 5.1}, {Ellie[offeror]} can revoke her offer anytime before acceptance. \n(12){HOWEVER} IF {Ellie[offeror]} did not communicate her {saying that the offer has been withdrawn[revocation of offer]} THEN revocation would be invalid. {Section 4.3} {AND} {Section 6}. \n(13) IF there is no valid revocation before {Frank[offeree]}'s acceptance THEN there is a valid contract.\n(14) {Frank[offeror]} {tells Galvin (offeree) that he has decided to sell at RM 5, 000[offer]}, IF {Galvin[offeree]} accept THEN there is a valid contract. \n(15) IF {Galvin[offeree]} say that he {would like to think about it[qualified acceptance]} THEN acceptance is qualified. \n(16) IF acceptance is qualified THEN there is no valid acceptance. {Section 7a}. \n(17) According to {Section 6} {AND}{Section 5.1}, IF {Frank[offeror]} communicate revocation of offer to {Galvin[offeree]} before acceptance THEN there is valid revocation. \n(18) {HOWEVER} revocation has to be made by {Frank[offeror]} not {Hassan who tells him that Frank has just agreed to sell the scooter to Jaya for RM6, 000[revocation by third party]}. {Section 4.3}\n(19) SINCE {Frank[offeror]} has not made a valid revocation of offer THEN offer can still be accepted by {Galvin[offeree]}. \n(20) According to {Section 3} {AND} {Section 4.2}, acceptance has to be communicated for it to be valid {AND} communication is complete when it is read by {Frank[offeror]} {Section 4.2b}. \n(21) IF {Galvin[offeree]} {Galvin immediately texted Frank accepting his offer[acceptance by instantaneous method]} is read by {Frank[offeror]} THEN it will be binding on {Galvin[offeree]}.\n(22) IF acceptance is not read by {Frank[offeror]} yet, {Galvin[offeree]} can revoke his acceptance {Section 5.2}. (20)\n(23) According to {Section 6}, revocation can be made by communicating to the offeror. \n(24) IF {Galvin changes his mind and calls on Frank to tell him to ignore the text message[revocation of acceptance]} THEN there is communication of revocation. \n(25) IF revocation of acceptance is communicated THEN there is no acceptance. \n(26) IF there is no acceptance THEN there is no contract. \n",
            "conclusion": "There is a valid contract between Ellie and Frank but no contract between Frank and Galvin. \n"
        },
  {
            "id": "s03",
            "type": "Contract Law",
            "scenario": "Andrew used to work for Peter. His job primarily consisted of collecting debts from Peter’s clients. One of Peter’s clients, Trevor, who did not know that Andrew had been dismissed, paid Andrew RM 200 which he owed Peter. Andrew disappeared with the money. Peter wants to know whether he can compel Trevor to pay him again.",
            "issue": " whether Peter can compel Trevor to pay him again\n",
            "dceompose question": "1. Whether Peteris bound by the acts of collecting debts? ",
            "analysis": "(1) IF {Peter[principal]} has induced {Trevor[third party]} into believing that {collecting debts from Peter’s clients[authority of agent]}by {Andrew[agent]} is authorised THEN {Peter[principal]} will be bound by those acts. {Section 190}\n(2) SINCE there is {Trevor, who did not know that Andrew had been dismissed,[belief that act was authorised]} THEN {Peter[principal]} would be bound by {Andrew[agent]}'s actions. \n(3) IF {Peter[principal]} is bound by {Andrew[agent]}'s actions THEN {Peter[principal]} cannot compel {Trevor[third party]} to pay him again.\n",
            "conclusion": "Peter cannot compel Trevor to pay him again."
        },
  {
            "id": "s04",
            "type": "Contract Law",
            "scenario": "Sam, the Accountant of XYZ Bhd, often acted as the Acting Manager of the company while the Managing Director and other senior staff were absent. His normal duties when in such a position involved overseeing internal company matters and ensuring that his own Accounting Department operated well. While acting as Acting Manager, Sam purchased land at auction from TP on behalf of the company for RM 1 million. ",
            "issue": "Whether XYZ is bound by Sam’s actions. \n",
            "dceompose question": "1. Does Sam have any authority? \n2. Whether Sam's authority is implied or express\n3. whether Sam's action of purchasing land on behalf of XYZ Bhd exceeds his authority? \n4. Whether Sam has apparent authority\n5. What can XYZ Bhd do if Sam has exceeded his authority?\n",
            "analysis": "(1) IF {Sam[agent]}{often acted as the Acting Manager of the company while the Managing Director and other senior staff were absent[implied authority]} THEN {overseeing internal company matters and ensuring that his own Accounting Department operated well.[authority of agent]} could be inferred from the circumstances of the case. {Section 140}\n(2) IF {Sam[agent]} has {overseeing internal company matters and ensuring that his own Accounting Department operated well.[authority of agent]} THEN he has authority to do any act to fulfil his duty as temporary acting manager of the company. {Section 141.1}\n(3) {HOWEVER} {Sam purchased land at auction from TP on behalf of the company for RM 1 million[act exceeding authority]} is not an act within {overseeing internal company matters and ensuring that his own Accounting Department operated well.[authority of agent]}. \n(4) IF {Sam[agent]} exceeded his authority THEN {XYZ Bhd[principal]} is not bound by the transaction. {Section 181}\n(5) {HOWEVER} IF {XYZ Bhd[principal]} has made a representation to {TP[third party]} that {Sam[agent]} has the authority to purchase land on their behalf THEN {Sam[agent]} has apparent authority. {CHEW HOCK SAN & ORS v CONNAUGHT HOUSING DEVELOPMENT SDN BHD [1985] 1 MLJ 350[353]}\n(6) IF {Sam[agent]} has apparent authority THEN {Sam[agent]} has not exceeded his authority.\n(7) IF (6) THEN {XYZ Bhd[principal]} will be bound by {Sam purchased land at auction from TP on behalf of the company for RM 1 million[act exceeding authority]}. \n(8) IF {XYZ Bhd[principal]} has not made a representation to {TP[third party]} that {Sam[agent]} has apparent authority to {Sam purchased land at auction from TP on behalf of the company for RM 1 million[act exceeding authority]} THEN {XYZ Bhd[principal]} not bound by the purchase of land. {Section 181}\n(9) IF {XYZ Bhd[principal]} is not bound THEN they could choose to ratify or disown the act. {Section 149}\n(10)ONLY IF {XYZ Bhd[principal]} ratify {Sam purchased land at auction from TP on behalf of the company for RM 1 million[act exceeding authority]} THEN there is a binding contract of sales between {XYZ Bhd[principal]} {AND} {TP[third party]}.\n",
            "conclusion": "If XYZ Bhd has made a representation to TP that Sam has authority to purchase land on their behalf then he will be bound by Sam's action. Alternatively, if they had not make such representation then they could choose to ratify or disown Sam's actions."
        },
  {
            "id": "s05",
            "type": "Contract Law",
            "scenario": "Jennifer is a young and very talented squash player. She is sixteen years old and in February 2016, she entered into an agreement in Malaysia with Lawrence (who is a prominent coach) whereby he undertook to train her and also decides which tournament she should play in. In return, Jennifer agreed to follow Lawrence's instructions and to pay him 25% of her winnings from all future tournaments for 2 years. In August 2017, Jennifer disobeyed Lavwrence's instruction to play in European open whereby the total prize money was US 1.2 million and instead prefers to defend her title in the Malaysian open tournament, where the total prize money was only RM350, 000. ",
            "issue": "whether Jennifer could be liable for breach of agreement",
            "dceompose question": "1. Is Jennifer a competent party to to contract\n2. If she is not, would she be bound by the agreement? \n3. Is the agreement between Jennifer and Lawrence a contract for necessary? \n",
            "analysis": "(1) IF both {Lawrence[adult contractor]} and {Jennifer[minor contractor]} are competent parties to contract THEN the agreement between them will be a contract. {Section 10.1}\n(2) According to {Section 11}, IF a person is of age of majority and is of sound mind and not disqualified from contracting THEN they will be a competent parties to contract. \n(3) IF both {Lawrence[adult contractor]} and {Jennifer[minor contractor]} is 18 and above THEN they have attained the age of majority. ( Age of Majority Act 1971 section 2) \n(4) When {Jennifer[minor contractor]} {entered into an agreement in Malaysia with Lawrence (who is a prominent coach) whereby he undertook to train her and also decides which tournament she should play in. In return, Jennifer agreed to follow Lawrence's instructions and to pay him 25% of her winnings from all future tournaments for 2 years.[agreement of apprenticeship]}, she is only 16 years old. \n(5) SINCE {Jennifer[minor contractor]} has not attained majority at 16 years old THEN she is not a competent party to a contract. \n(6) {HOWEVER} when the agreement is for necessaries suited to the conditions of life of {Jennifer[minor contractor]} THEN {Jennifer[minor contractor]} could be liable for {Jennifer disobeyed Lavwrence's instruction to play in European open[breach of agreement]} {Section 69}\n(7) IF the agreement between {Jennifer[minor contractor]} and {Lawrence[adult contractor]} is a contract of apprenticeship which would enable {Jennifer[minor contractor]} to become a professional squash player that could enable her to earn a living for herself THEN the agreement could be considered to be for necessary. {GOVERNMENT OF MALAYSIA v GURCHARAN SINGH & ORS [1971] 1 MLJ 211[216-217]}. \n(8) SINCE {entered into an agreement in Malaysia with Lawrence (who is a prominent coach) whereby he undertook to train her and also decides which tournament she should play in. In return, Jennifer agreed to follow Lawrence's instructions and to pay him 25% of her winnings from all future tournaments for 2 years.[agreement of apprenticeship]} is necessary THEN {Jennifer[minor contractor]} would be liable for {Jennifer disobeyed Lavwrence's instruction to play in European open[breach of agreement]} despite her lack of capacity.\n",
            "conclusion": "Jennifer will be liable for breach of agreement.\n"
        },
  {
            "id": "s06",
            "type": "Contract Law",
            "scenario": "Jennifer is sixteen years old and in February 2016, she entered into an agreement in Malaysia with Lawrence to buy a luxury item. Jennifer received the item but later refused to pay.\n",
            "issue": "whether Jennifer could be liable for breach of agreement\n",
            "dceompose question": "1. Is Jennifer a competent party to to contract\n2. If she is not, would she be bound by the agreement? \n3. Is the agreement between Jennifer and Lawrence a contract for necessary? \n",
            "analysis": "(1) IF both {Lawrence[adult contractor]} and {Jennifer[minor contractor]} are competent parties to contract THEN the agreement between them will be a contract. {Section 10.1}\n(2) According to {Section 11}, IF a person is of age of majority and is of sound mind and not disqualified from contracting THEN they will be a competent parties to contract. \n(3) IF both {Lawrence[adult contractor]} and {Jennifer[minor contractor]} is 18 and above THEN they have attained the age of majority. ( Age of Majority Act 1971 section 2) \n(4) When {Jennifer[minor contractor]} entered into the agreement with {Lawrence[adult contractor]} , she is only 16 years old. \n(5) SINCE {Jennifer[minor contractor]} has not attained majority at 16 years old THEN she is not a competent party to a contract. \n(6) {HOWEVER} when the agreement is for necessaries suited to the conditions of life of {Jennifer[minor contractor]} THEN {Jennifer[minor contractor]} could be liable for breach of agreement {Section 69}\n(7) SINCE the agreement between {Jennifer[minor contractor]} and {Lawrence[adult contractor]} is not an agreement for necessaries suited to the conditions of life of {Jennifer[minor contractor]} THEN {Jennifer[minor contractor]} will not be liable for breach of agreement.\n",
            "conclusion": "Jennifer will not be liable for breach of agreement.\n"
        },
  {
            "id": "s07",
            "type": "Contract Law",
            "scenario": "X has several outstanding debts, including: RM 10,000 owing to B RM 5,000 owing to C Y, X’s father, offers to pay B the sum of RM2,500 on the understanding that B will not make any claims against X for the balance of the RM10,000 debt. B agrees but later changes his mind and claims the balance of the debt owed by X. C agrees to accept a sweepstake ticket in the Melbourne Cup in settlement of the debt. Later C thinks that the ticket was not sufficient and wants repayment of half the RM5,000 debt in addition to the ticket. ",
            "issue": "whether B and C can change their mind and demand repayment of whole debt.",
            "dceompose question": "1. Is B's promise to forgo the rest of the debt supported by considerations? \n2. Does the part payment of debt by X's father amount to valid considerations? \n3. Is C's promise to forgot the debt supported by considerations? \n4. Does the sweepstake ticket amount to valid considerations? \n",
            "analysis": "(1) IF {the understanding that B will not make any claims against X for the balance of the RM10,000 debt[promise by creditor 1]} {AND} {C agrees to accept a sweepstake ticket in the Melbourne Cup in settlement of the debt[promise by creditor 2]} are supported by consideration THEN both promise will be binding contracts. {Section 10.1}\n(2) IF {RM2,500[consideration to creditor 1's promise]}{AND}{a sweepstake ticket in the Melbourne Cup[consideration to creditor 2's promise]} provided by {X's father[third party]} is sufficient consideration THEN {the understanding that B will not make any claims against X for the balance of the RM10,000 debt[promise by creditor 1]}{AND}{C agrees to accept a sweepstake ticket in the Melbourne Cup in settlement of the debt[promise by creditor 2]} will be binding. {Section 2d}\n(3) According to {Section 64}, {RM2,500[consideration to creditor 1's promise]}{AND}{a sweepstake ticket in the Melbourne Cup[consideration to creditor 2's promise]} are sufficient consideration to discharge the whole debt. \n(4) SINCE {RM2,500[consideration to creditor 1's promise]}{AND}{a sweepstake ticket in the Melbourne Cup[consideration to creditor 2's promise]} is sufficient consideration THEN {B[creditor 1]}{AND}{C[creditor 2]} cannot demand repayment of whole debt.\n",
            "conclusion": "B and C cannot demand repayment of whole debt."
        },
  {
            "id": "s08",
            "type": "Contract Law",
            "scenario": "Debbie is going overseas for two months. She asks Michael who is a police officer, and who happened to live in the same neighbourhood to keep an eye on her house while she is away. Debbie promised to pay Michael RM2,000 when she returns. After returning from overseas, Debbie realizes that she doesn't need to pay anything to Michael because Michael is just doing his duty as a police officer. ",
            "issue": "whether Debbie's promise is supported by valid considerations",
            "dceompose question": "1. Does Michael's action amount to valid considerations?\n2. Does Michael's action amount to valid considerations despite his public duty as a police officer? \n",
            "analysis": "(1) IF {Michael[promisee]} have done an act at the desire of {Debbie[promisor]} THEN there is consideration. {Section 2d}\n(2)IF {Michael[promisee]} is only performing within the bound of his{police officer[public duty]} THEN there is no valid considerations. {GLASBROOK BROTHERS, LIMITED APPELLANTS; AND GLAMORGAN COUNTY COUNCIL AND OTHERS RESPONDENTS. [1925] A.C. 270[272]}\n(3) {HOWEVER}IF {to keep an eye on her house while she is away[promise]} exceeded the bound of {Michael[promisee]}'s {police officer[public duty]} THEN performance of {to keep an eye on her house while she is away[promise]} would amount to special services. {HARRIS v. SHEFFIELD UNITED FOOTBALL CLUB LTD. [1988] Q.B. 77[81]}\n(4) IF {Michael[promisee]}'s {to keep an eye on her house while she is away[promise]} amount to special services THEN it will amount to valid considerations. {HARRIS v. SHEFFIELD UNITED FOOTBALL CLUB LTD. [1988] Q.B. 77[94]}\n",
            "conclusion": "Debbie's promise to pay would be supported by valid considerations if Michael's promise to keep an eye on her house exceed his public duty as a police officer.\n"
        },
  {
            "id": "s09",
            "type": "Contract Law",
            "scenario": "Annie takes her expensive coat to Simon’s Dry Cleaning. She is handed a ticket, the face of which contains a number, her name, a description of the coat and an annotation to the effect that the coat will be available for collection the following Friday. On the reverse side in small print are the words: ‘Conditions apply’. On the rear wall facing the counter is a sign written in even smaller print which reads: ‘Simon’s Dry Cleaning will not be liable for any stains or other damage to any clothing whatsoever’. On Annie’s return she discovers the coat has bad stain marks on it. \n",
            "issue": "whether the exemption clause is effective.",
            "dceompose question": "1. whether the exemption clause on the ticker is incorporated into the contract \n2. Does the small print on the reverse side of the ticket amount to sufficient notice? \n3. whether the exemption clause on the sign is incorporated into the contract\n4. if the exemption clause is incorporated, would it be effective? \n5. how would the court interpret the exemption clause\n6. Would the exemption clause be effective if the stain marks are caused by negligence? \n7. What can Annie do if the exemption clause is incorporated ?\n",
            "analysis": "(1) IF {a ticket[document containing exemption clause]} is not a contractual document which {Annie[claimant]} would expect to contains contractual terms THEN {'Conditions apply'[exemption clause]} is not incorporated unless if sufficient notice has been brought to {Annie[claimant]}. {CHAPELTON v. BARRY URBAN DISTRICT COUNCIL. [1940] 1 K.B. 532[537]}\n(2) SINCE {'Conditions apply'[exemption clause]} is written at the back in small print THEN {a ticket[document containing exemption clause]} does not contain sufficient notice to the {'Conditions apply'[exemption clause]}. \n(3) IF (2) THEN  {'Conditions apply'[exemption clause]} is not incorporated. {Henderson and others v Stevenson [1874-80] All ER Rep 436[439-440]}.\n(4) {'Simon's Dry Cleaning will not be liable for any stains or other damage to any clothing whatsoever’.[exemption clause]} would be incorporated into the contract ONLY IF at the time of contract {Simon's Dry Cleaning[defendant]} has taken reasonable steps to bring it to {Annie[claimant]}'s attention. {THORNTON v. SHOE LANE PARKING LTD. [1967 T. No. 1206] [1971] 2 Q.B. 163[169]}\n(5) IF {a sign written in even smaller print which reads: 'Simon's Dry Cleaning will not be liable for any stains or other damage to any clothing whatsoever’.[notice of exemption clause]} is insufficient THEN {'Simon's Dry Cleaning will not be liable for any stains or other damage to any clothing whatsoever’.[exemption clause]} is not incorporated. \n(6) EVEN IF {a sign written in even smaller print which reads: 'Simon's Dry Cleaning will not be liable for any stains or other damage to any clothing whatsoever’.[notice of exemption clause]} is sufficient notice, {'Simon's Dry Cleaning will not be liable for any stains or other damage to any clothing whatsoever’.[exemption clause]} could be interpreted narrowly to exclude negligence. {PREMIER HOTEL SDN BHD v TANG LING SENG [1995] 4 MLJ 229[232]}\n(7) IF (6) {AND} stain marks is caused by negligence THEN {Simon's Dry Cleaning[defendant]} will not be protected by {'Simon's Dry Cleaning will not be liable for any stains or other damage to any clothing whatsoever’.[exemption clause]}. \n(8) EVEN IF {'Simon's Dry Cleaning will not be liable for any stains or other damage to any clothing whatsoever’.[exemption clause]} is not interpreted narrowly, IF {Annie[claimant]} can prove unfair contract term THEN {'Simon's Dry Cleaning will not be liable for any stains or other damage to any clothing whatsoever’.[exemption clause]} will be ineffective (Consumer Protection Act 1999, s.24D) (Consumer Protection Act 1999, s.24G)\n",
            "conclusion": "exemption clause will be ineffective if there is insufficient notice. Alternatively, if there is sufficient notice to incorporate the exemption clause, the clause would still be ineffective if the court interpret it narrowly or if Annie could prove unfair contract terms."
        },
  {
            "id": "s10",
            "type": "Contract Law",
            "scenario": "Jim runs a small cartage operation in Kuala Lumpur. One of his best customers is ABC Bhd, which operates a chain of retail stores throughout the metropolitan area. ABC uses Jim to transfer goods from one store to another as the situation requires. The agreed procedure is always the same. ABC telephones Jim and gives him the collection point and the destination. Jim picks up the goods. An employee of ABC and Jim fill in and sign a collection docket. ABC keeps the duplicate. Jim takes the goods directly to the drop off point and has the docket countersigned by another employee of ABC. At 12.30 pm on June 5th Jim collects a quantity of expensive goods from one of ABC’s shops. The usual procedure on collection is followed. The docket is filled in, signed and a duplicate kept by ABC. As it is nearly lunch time Jim decides to have lunch before delivering the goods. He travels a number of kilometres off the direct route to another suburb to collect a friend. Together they then go to a hotel which has a great counter lunch. Jim parks on a steep hill. Unfortunately Jim hasn’t checked his brakes lately. They slip and the vehicle races down the hill smashing into a number of obstacles on the way. The goods belonging to ABC are totally destroyed. ABC maintains that Jim must pay for the goods. Jim denies liability on the basis of the exclusion clause. Ticket Terms: This receipt is an acknowledgment that the goods were delivered to Jim in reasonable condition. Consignor must arrange own insurance. Under no circumstances is Jim to be regarded as a common carrier. Jim will use best endeavours to ensure goods delivered safely. Jim does not accept any responsibility for any loss or damage to any goods carried pursuant to this contract however such loss or damage may arise or be caused whether by negligence or otherwise. ",
            "issue": "whether Jim could rely on exemption clause",
            "dceompose question": "1. is the exemption clause on the docket incorporated into the contract? \n2. Is the exemption clause on the docker incorporated by past dealings? \n3. how would the court interpret the exemption clause if it is incorporated into the contract? \n4.  Would Jim's actions of deviation from direct route affect the effectiveness of the exemption clause? \n5. Does Jim's actions of deviation from direct route amount to fundamental breach? \n",
            "analysis": "(1) IF {ABC Bhd[claimant]}has given their {An employee of ABC and Jim fill in and sign a collection docket[signature]}THEN {Jim does not accept any responsibility for any loss or damage to any goods carried pursuant to this contract however such loss or damage may arise or be caused whether by negligence or otherwise.[exemption clause]} is incorporated even if {ABC Bhd[claimant]} has not read it. {Chin Well Fasteners Co Sdn Bhd v Sampath Kumar Vellingiri & Ors [2006] 1 MLJ 117[129]}\n(2) EVEN IF it is not incorporated by signature, IF {ABC Bhd[claimant]} {AND}{Jim[defendant]}had {ABC uses Jim to transfer goods from one store to another as the situation requires. The agreed procedure is always the same.[consistent past dealings with the same terms]}THEN {Jim does not accept any responsibility for any loss or damage to any goods carried pursuant to this contract however such loss or damage may arise or be caused whether by negligence or otherwise.[exemption clause]}could be implied. {POPULAR INDUSTRIES LIMITED v EASTERN GARMENT MANUFACTURING SDN BHD [1989] 3 MLJ 360[364]}\n(3) IF {Jim does not accept any responsibility for any loss or damage to any goods carried pursuant to this contract however such loss or damage may arise or be caused whether by negligence or otherwise.[exemption clause]} is incorporated, the courts would look at the true construction of exemption clause to determine if {The goods belonging to ABC are totally destroyed.[breach of contract]} is covered by {Jim does not accept any responsibility for any loss or damage to any goods carried pursuant to this contract however such loss or damage may arise or be caused whether by negligence or otherwise.[exemption clause]} {PHOTO PRODUCTION LTD. RESPONDENTS AND SECURICOR TRANSPORT LTD. APPELLANTS [1980] A.C. 827[841]}\n(4) IF (3) THEN {He travels a number of kilometres off the direct route to another suburb to collect a friend. Together they then go to a hotel which has a great counter lunch. Jim parks on a steep hill.[deviation from contract]} amounts to a fundamental breach against {Jim will use best endeavours to ensure goods delivered safely[another part of exemption clause]}.\n(5) IF there is a fundamental breach THEN Jim will not be able to rely on {Jim does not accept any responsibility for any loss or damage to any goods carried pursuant to this contract however such loss or damage may arise or be caused whether by negligence or otherwise.[exemption clause]}. {Mayban Trustees Bhd v CIMB Bank Bhd and other appeals [2012] 2 MLJ 187[215-216]}\n(6) IF (5) THEN {Jim[defendant]} cannot rely on {Jim does not accept any responsibility for any loss or damage to any goods carried pursuant to this contract however such loss or damage may arise or be caused whether by negligence or otherwise.[exemption clause]}. \n",
            "conclusion": "Jim cannot rely on exemption clause"
        },
  {
            "id": "s11",
            "type": "Contract Law",
            "scenario": "On 1 March 2017, the Monash Soccer Team booked a flight to London to participate in the World Universities Football Cup from 21 to 26 March 2017. Their travel agents, Freedom Flight Sdn Bhd, gave a discount fare of RM 2,000 per person, 50% of the price was paid upon booking and the balance of the price was to be paid on 19 March 2017 upon collecting the tickets. On 18 March 2017, the air traffic controllers of KLIA declared a strike when the airport management refused to reduce their retirement age to 45 years old. When the Monash Soccer Team went to Freedom Flight Sdn Bhd on 19 March 2015, he refused to pay the balance unless it is confirmed that the team can fly out of Kuala Lumpur on 19 March 2015. The strike lasted for three days. By that time it was too late for the team to compete in the competition. The Monash Soccer Team claims for the return of the sum paid to Freedom Flight Sdn Bhd. Freedom Flight Sdn Bhd refused to return it and instead sued for the balance 50% to be paid by the Monash Soccer Team. \n",
            "issue": "whether Freedom Flight Sdn Bhd could keep the sum paid by Monash Soccer Team and whether they could claim the balance 50%",
            "dceompose question": "1. whether the contract is frustrated by air traffic controllers' strike \n2. Does the air traffic controllers' strike render the contract impossible \n3. What can the Monash Soccer Team do if the contract is frustrated? \n4. What can Freedom Flight Sdn Bhd do if the contract is frustrated? \n5. Does Freedom Flight Sdn Bhd have to return all the money they have received from Monash Soccer Team if the contract is frustrated? \n",
            "analysis": "(1) IF {a flight to London[the contract]} becomes impossible due to {the air traffic controllers of KLIA declared a strike when the airport management refused to reduce their retirement age to 45 years old.[frustrating event]}THEN the contract becomes void. {Section 57.2}\n(2) ACCORDING TO {Guan Aik Moh (KL) Sdn Bhd & Anor v Selangor Properties Bhd [2007] 4 MLJ 201[207]} IF no provision has been made in the contract to cover the {the air traffic controllers of KLIA declared a strike when the airport management refused to reduce their retirement age to 45 years old.[frustrating event]}{AND} {the air traffic controllers of KLIA declared a strike when the airport management refused to reduce their retirement age to 45 years old.[frustrating event]}is not self-induced {AND} the circumstances has become so radically different that it is unjust for court to enforce {a flight to London[the contract]}THEN {Section 57.2} can be invoked. \n(3) IF{the air traffic controllers of KLIA declared a strike when the airport management refused to reduce their retirement age to 45 years old.[frustrating event]}renders the circumstances so radically different that {a flight to London[the contract]} is incapable of being performed THEN it renders performance of {a flight to London[the contract]} impossible.{LEE SENG HOCK v FATIMAH BTE ZAIN [1996] 3 MLJ 665[673]}\n(4) IF {the air traffic controllers of KLIA declared a strike when the airport management refused to reduce their retirement age to 45 years old.[frustrating event]}is beyond the control of {Freedom Flight Sdn Bhd[party to contract (2)]}{AND}{Monash Soccer Team[party to contract (1)]}THEN it is not self-induced. {BIG Industrial Gas Sdn Bhd v Pan Wijaya Property Sdn Bhd and another appeal [2018] MLJU 54[47]}\n(5) IF {a flight to London[the contract]}does not provide for provision which cover an event of workers strike THEN {the air traffic controllers of KLIA declared a strike when the airport management refused to reduce their retirement age to 45 years old.[frustrating event]}is an unforeseeable event not covered by contract. {YEE SENG PLANTATIONS SDN BHD v KERAJAAN NEGERI TERENGGANU & ORS [2000] 3 MLJ 699[709]}\n(6) IF all three elements is fulfilled THEN {a flight to London[the contract]}is frustrated. \n(7) IF (6) THEN contract becomes void. \n(8) IF (7) THEN {Freedom Flight Sdn Bhd[party to contract (2)]} is required to return the sum paid to {Monash Soccer Team[party to contract (1)]}{Section 66}{AND}{Freedom Flight Sdn Bhd[party to contract (2)]} cannot demand {Monash Soccer Team[party to contract (1)]}to pay the remaining 50% (Civil Law Act 1956 s.15(1)). \n(9){HOWEVER}{Freedom Flight Sdn Bhd[party to contract (2)]} could recover any reasonable cost incurred by them up until the date the contract becomes frustrated. (Civil Law Act 1956 s.15(2)).\n",
            "conclusion": "Freedom Flight Sdn Bhd cannot keep the sum paid by Monash Soccer Team and they cannot claim the balance 50%\n"
        },
  {
            "id": "s12",
            "type": "Contract Law",
            "scenario": "On 30 February 2016, Mr. Ritz signed a contract for the purchase of a house with a housing developer, Ron Realty Sdn Bhd. The contract stipulated the date for the completion and giving of possession of the house on 30 January 2017. Immediately thereafter, the economy in China started to slow down due to international trade restrictions and as a consequence the cost of steel in China doubled. The main supplier of steel to Ron Realty Sdn Bhd was in China and as a result the whole housing project became uneconomical. On December 2016, Ron Realty sent a letter to Mr. Ritz terminating the sale and purchase agreement for reason of frustration caused by the economic crisis in China. Mr. Ritz refused to accept the termination arquing that economic down turn was not a frustrating event. ",
            "issue": "whether Ron Realty Sdn Bhd can rely on doctrine of frustration",
            "dceompose question": "1. Does the economic downturn amount to a frustrating event? \n2. Does the economic downturn renders performance of contract impossible or radically different?\n3. Would Ron Realty Sdn Bhd still be able to rely on doctrine of frustration if the economic downturn made the performance of contract more onerous?\n4. Would  Ron Realty Sdn Bhd still be able to rely on doctrine of frustration if the contract between them contain a provision which provide for a scenario of economic downturn\n",
            "analysis": "(1) IF {the economy in China started to slow down due to international trade restrictions and as a consequence the cost of steel in China doubled. The main supplier of steel to Ron Realty Sdn Bhd was in China and as a result the whole housing project became uneconomical[frustrating event]}renders the contract impossible THEN {purchase of a house with a housing developer[the contract]}becomes void. {Section 57.2}\n(2) ACCORDING TO {Guan Aik Moh (KL) Sdn Bhd & Anor v Selangor Properties Bhd [2007] 4 MLJ 201[207]}, IF no provision has been made in the contract to cover {the economy in China started to slow down due to international trade restrictions and as a consequence the cost of steel in China doubled. The main supplier of steel to Ron Realty Sdn Bhd was in China and as a result the whole housing project became uneconomical[frustrating event]}{AND} {the economy in China started to slow down due to international trade restrictions and as a consequence the cost of steel in China doubled. The main supplier of steel to Ron Realty Sdn Bhd was in China and as a result the whole housing project became uneconomical[frustrating event]}is not self-induced {AND} the circumstances has become so radically different that it is unjust for court to enforce {purchase of a house with a housing developer[the contract]}THEN {Section 57.2}can be invoked. \n(3) IF {purchase of a house with a housing developer[the contract]} does not provide for provision which cover an event of economic downturn THEN {the economy in China started to slow down due to international trade restrictions and as a consequence the cost of steel in China doubled. The main supplier of steel to Ron Realty Sdn Bhd was in China and as a result the whole housing project became uneconomical[frustrating event]}is an unforeseeable event not covered by contract. {YEE SENG PLANTATIONS SDN BHD v KERAJAAN NEGERI TERENGGANU & ORS [2000] 3 MLJ 699[709]}\n(4) IF the economic downturn is beyond control of {Mr. Ritz[party to contract (1)]}{AND}{Ron Realty Sdn Bhd[party to contract(2)]}THEN it is not self-induced. {BIG Industrial Gas Sdn Bhd v Pan Wijaya Property Sdn Bhd and another appeal [2018] MLJU 54[47]}\n(5) {HOWEVER} IF economic downturn merely resulted in performance of {purchase of a house with a housing developer[the contract]} more expensive {OR} more onerous THEN it does not render the contract radically different {OR} impossible. {Sentul Raya Sdn Bhd v Hariram a/l Jayaram & Ors [2008] 4 MLJ 852[861]}\n(6) IF (5) THEN {the economy in China started to slow down due to international trade restrictions and as a consequence the cost of steel in China doubled. The main supplier of steel to Ron Realty Sdn Bhd was in China and as a result the whole housing project became uneconomical[frustrating event]}is not a frustrating event. \n(7) IF (6) THEN {Section 57.2} cannot be invoked.\n",
            "conclusion": "Ron Realty Sdn Bhd cannot rely on doctrine of frustration"
        },
  {
            "id": "s13",
            "type": "Contract Law",
            "scenario": "Cathy’s son, Dave, aged 21, was studying for a diploma in computer science at a University in Kuala Lumpur. He lived in a student residence. It was a city council legislative requirement that it was illegal to smoke in student residence, offices, shops, or any enclosed place where someone else is residing, studying or working within the campus. Dave gave up smoking due to this requirement. However, Cathy was worried that under the pressure of preparing for the examination Dave would start smoking again, and so she promised to pay Dave RM500 if he did not smoke at all until he had completed the course. She also promised to buy him a car if he passed the examinations. Cathy run an online bookstore, and asked Dave to maintain and update the website from time to time. She was pleased with the result, and said she would give him RM1,000 ‘for all his hard work’. Dave passed his examinations, obtained his diploma and moved to live in Johor Bahru where there was no legal requirement on banning of smoking in public enclosed areas. He has not started to smoke again after he left Kuala Lumpur. Cathy has not made either of the promised payments, or bought the car. \n",
            "issue": "whether Cathy is legally obliged to pay Dave RM500 and RM1000 and whether Cathy is legally obliged to buy a car for Dave.",
            "dceompose question": "1. Is Cathy's promise to pay Dave RM500 for not smoking supported by valid considerations \n2. Is Cathy's promise to buy Dave a car supported by valid considerations \n3. Is Cathy's promise to pay Dave RM1000for all his hard work supported by valid considerations \n4. Does the relationship between Cathy and Dave affect the enforceability of the promise to pay RM500, RM 1000 and to buy a car? \n5. Is Cathy's promise to Dave supported by intention to create legal relations?\n",
            "analysis": "(1) IF {she promised to pay Dave RM500 if he did not smoke at all until he had completed the course[promise (1)]} is supported by consideration THEN it is enforceable. {Section 26}\n(2) IF {Dave[promisee]} has abstained from smoking at the desire of {Cathy[promisor]} THEN {she promised to pay Dave RM500 if he did not smoke at all until he had completed the course[promise (1)]} is supported by consideration. {Section 2d}\n(3) {HOWEVER} IF there is a {legislative requirement that it was illegal to smoke in student residence, offices, shops, or any enclosed place where someone else is residing, studying or working within the campus[pre-existing legal duty]} THEN {Dave[promisee]}'s abstinence from smoking is not consideration. {Collins v Godefroy (1831) 109 ER 1040[952]}\n(4) EVEN IF {she promised to pay Dave RM500 if he did not smoke at all until he had completed the course[promise (1)]} is supported by consideration, {she promised to pay Dave RM500 if he did not smoke at all until he had completed the course[promise (1)]} will be legally enforceable ONLY IF it is made with intention to create legal relations. {Sri Kajang Rock Products Sdn Bhd v Mayban Finance Bhd & Ors [1992] 1 CLJ 204[206]}\n(5) SINCE {Dave[promisee]} {AND} {Cathy[promisor]} is mother and son THEN {she promised to pay Dave RM500 if he did not smoke at all until he had completed the course[promise (1)]} is an agreement between family. \n(6) IF (5) THEN there is a rebuttable presumption that there is no intention to create legal relations.{CHOO TIONG HIN & ORS v CHOO HOCK SWEE [1959] 1 MLJ 67[69]}\n(7) IF {Dave[promisee]} does not provide evidence to rebut the presumption THEN {she promised to pay Dave RM500 if he did not smoke at all until he had completed the course[promise (1)]} is not legally enforceable. \n(8) IF {promised to buy him a car if he passed the examinations[promise(2)]} is supported by consideration THEN it is enforceable. {Section 26}\n(9) IF {Dave[promisee]} has passed the examination at the desire of {Cathy[promisor]} THEN {promised to buy him a car if he passed the examinations[promise(2)]} is supported by considerations. {Section 2d}\n(10) {HOWEVER} EVEN IF {promised to buy him a car if he passed the examinations[promise(2)]} is supported by considerations, {promised to buy him a car if he passed the examinations[promise(2)]} will be legally enforceable ONLY IF it is made with intention to create legal relations. {Sri Kajang Rock Products Sdn Bhd v Mayban Finance Bhd & Ors [1992] 1 CLJ 204[206]}\n(11) ACCORDING TO (5) {AND} (6) THEN there is a rebuttable presumption that there is no intention to create legal relations. \n(12)IF {Dave[promisee]} does not provide evidence to rebut the presumption THEN {promised to buy him a car if he passed the examinations[promise(2)]} is not legally enforceable. \n(13) IF {she would give him RM1,000 ‘for all his hard work’.[promise (3)]} is supported by consideration THEN it is enforceable. {Section 26}\n(14) IF {Dave[promisee]}'s {asked Dave to maintain and update the website from time to time.[past consideration]} is at the request of {Cathy[promisor]} THEN it is sufficient consideration. {SOUTH EAST ASIA INSURANCE BHD v NASIR IBRAHIM [1992] 2 MLJ 355[362-363]}\n(15) {HOWEVER} {she would give him RM1,000 ‘for all his hard work’.[promise (3)]} will be legally enforceable ONLY IF it is made with intention to create legal relations. {Sri Kajang Rock Products Sdn Bhd v Mayban Finance Bhd & Ors [1992] 1 CLJ 204[206]}\n(16) ACCORDING TO (5) {AND} (6) THEN there is a rebuttable presumption that there is no intention to create legal relations. \n(17) IF {Dave[promisee]} does not provide evidence to rebut the presumption THEN {she would give him RM1,000 ‘for all his hard work’.[promise (3)]}is not legally enforceable. \n(18) IF all three agreements are not legally enforceable THEN {Cathy[promisor]} is not legally obliged to fulfill them.\n",
            "conclusion": "Cathy is not legally obliged to pay Dave RM500 and RM1000 and she is also not legally obliged to buy Dave a car."
        },
  {
            "id": "s14",
            "type": "Contract Law",
            "scenario": "Lilian runs a small tailor shop in Putrajaya specialising in batik wear for women. Her husband Mike owns a factory manufacturing clothes and is able to purchase his fabric much more cheaply than Lilian. On Friday night, after cooking Mike’s favourite meal, Lilian asked Mike if he would supply her shop with fabric at his cost price. Mike said, “Of course darling.” Lilian then decides to expand her business to include batik wear for men and children. On Monday she rings her dye supplier in Kuantan and talks to Neil. She discusses her plans to expand her tailoring business and her need to order additional fabric dye colours suitable for silk, synthetic and cotton fabrics. Neil tells Lilian that all the dye they supply is of the highest quality. Lilian orders 2 dozen of red dye at the price of RM50 each, to be delivered next Friday. She also inquires about gold and silver dyes, and is told by Neil that gold dyes are available for RM150 each, and silver for RM100. Lilian tells Neil that she is prepared to pay RM130 for the gold dye and RM80 for the silver. Lilian also tells Neil that if she doesn’t hear to the contrary, she will take 5 gold and 5 silver boxes of dye, to be delivered with the red dye on Friday. On Friday morning, Lilian receives a delivery from Neil of 24 boxes of red dye. Lilian rings Neil and told him there are no gold or silver dyes. Neil told Lilian he has decided not to supply them at Lilian’s price. Lilian later calls Mike and asks him to send over some fabric she needs at cost price as agreed. Mike replies that he will only provide her with fabric at market price. She protests and reminds him of last Friday evening. He replies, “That was dinner, this is business.” After Lilian hangs up, her assistant Olivia shows her an order for silk scarves on which she has been working using the red dye supplied by Neil. The dye is pale and streaky. She tells Lilian there is a problem with the dye as it is not suitable for silk.",
            "issue": "whether there is any enforceable contract between Lilian and Mike, whether whether there is a contract between Lilian and Neil for gold and silver dye, Whether there is an enforceable term on the quality of red dye\n",
            "dceompose question": "1. Is the agreement between Lilian and Mike supported by intention to create legal relations? \n2. Did Lilian accept Neil's offer to sell the gold dye at RM 150 each and silver dye at RM 100 each? \n3. Does Neil's silence amount to valid acceptance? \n4. Is Neil's statement regarding the quality of dye an enforceable term? \n5. If Neil's statement regarding quality of dye is not an enforceable term, what can Lilian do? \n6. Can Lilian rely on the sale of goods act 1957?\n",
            "analysis": "(1) IF {supply her shop with fabric at his cost price[first agreement]} is supported by intention to create legal relations THEN it is enforceable. {Sri Kajang Rock Products Sdn Bhd v Mayban Finance Bhd & Ors [1992] 1 CLJ 204[206]}\n(2) IF {Lilian[party to first contract (2)]}{AND}{Mike[party to first contract (1)]} is a husband and wife THEN {supply her shop with fabric at his cost price[first agreement]} is an agreement between family. \n(3) IF (2) THEN there is a rebuttable presumption that there is no intention to create legal relations. {CHOO TIONG HIN & ORS v CHOO HOCK SWEE [1959] 1 MLJ 67[69]}\n(4)IF {supply her shop with fabric at his cost price[first agreement]} is in a business setting THEN presumption could be rebutted. {Snelling v John G Snelling Ltd [1973] 1 QB 87[93]}\n(5){HOWEVER} it is unlikely that presumption would be rebutted even if {Lilian[party to first contract (2)]} was talking about her business because {supply her shop with fabric at his cost price[first agreement]} was brought up during dinner which is not a business setting. \n(6) IF (5) THEN {supply her shop with fabric at his cost price[first agreement]} is not enforceable.\n(7) IF {told by Neil that gold dyes are available for RM150 each, and silver for RM100[original offer]} is accepted by {Lilian[party to second contract (1)]} THEN there is a contract. {Section 2b}\n(8) SINCE {Lilian[party to second contract (1)]} have respond with {Lilian tells Neil that she is prepared to pay RM130 for the gold dye and RM80 for the silver[counter offer]} THEN there is no acceptance. {Section 7a}{MALAYAN FLOUR MILLS BHD v SAW ENG CHEE (ADMINISTRATOR OF THE ESTATE OF SAW CHENG CHOR, DECEASED) & ANOR [1997] 1 MLJ 763[764]}\n(9) ACCORDING TO {Seloga Sdn Bhd v UEM Gynisys Sdn Bhd [2007] 7 MLJ 385[406]}, {Lilian[party to second contract (1)]} cannot take {Neil[party to second contract (2)]}'s silence as acceptance by {Lilian also tells Neil that if she doesn’t hear to the contrary, she will take 5 gold and 5 silver boxes of dye, to be delivered with the red dye on Friday.[express stipulation]}. \n(10) IF (9) THEN there is no acceptance. \n(11) IF (10) THEN there is no contract between {Lilian[party to second contract (1)]}{AND}{Neil[party to second contract (2)]}.\n(12) IF {Lilian[party to second contract (1)]}{AND}{Neil[party to second contract (2)]} intended {all the dye they supply is of the highest quality.[oral statement]} to have contractual effect THEN it is a term that can be enforced. {Heilbut, Symons & Co v Buckleton [1913] AC 30[51]}\n(13) IF {Neil[party to second contract (2)]}'s {all the dye they supply is of the highest quality.[oral statement]} is a mere puff THEN it is not supported by intentions.\n(14) IF (13) THEN {all the dye they supply is of the highest quality.[oral statement]} is not an enforceable term. \n(15) {HOWEVER}, SINCE {Lilian[party to second contract (1)]} had made known her purpose to use the red dye on silk to {Neil[party to second contract (2)]} THEN there is an implied term that the red dye shall be reasonably fit for that purpose (Sale of Goods Act 1957, s.16(1)(a))\n(16) IF (15) THEN there is an enforceable term on the quality of red dye\n",
            "conclusion": "there is no enforceable contract between Lilian and Mike unless if presumption of no intention is rebutted, there is no contract between Lilian and Neil for gold and silver dye, there is an enforceable term on the quality of red dye implied under s.16(1)(a) of the sale of goods act 1957\n"
        },
  {
            "id": "s15",
            "type": "Contract Law",
            "scenario": "Amatjit who intends to buy a cow went to 7akariah's farm house. Alter a walk through and having liked a particular cow, Amarjit asked for assurance whether or not this cow was suffering from any particular illness because he wants to buy for breeding purposes. Zakarlan said ‘the cow iS perfectly healthy; you need not worry about anythung’. Feeling assured, Amarjit immediately bought the cow. Zakariah knew that this cow have been suffering from illness lately and a recent visit by a vet doctor confirmed that the cow was ill and could only survive for another couple of weeks. After the purchase and less than two weeks later, the cow died from illness. ",
            "issue": "whether the contract is voidable by fraud",
            "dceompose question": "1, Whether is the consent caused by fraud? \n 2. Whether the contract is obtained by fraud? ",
            "analysis": "(1) Agreements will be contract ONLY IF it is made with free consent of {Amatjit[party to contract (1)]}{AND}{Zakariah[party to contract (2)]}. {Section 10.1}\n(2) IF consent is not caused by fraud THEN consent is free. {Section 14c}\n(3) IF {Zakariah[party to contract (2)]} has made {‘the cow iS perfectly healthy; you need not worry about anythung’.[suggestion of fact]} which is untrue {AND} {Zakariah[party to contract (2)]} does not believe it to be true to induce {Amatjit[party to contract (1)]} to enter into the contract THEN there is fraud. {Section 17a}\n(4) SINCE {Zakariah[party to contract (2)]} has {knew that this cow have been suffering from illness lately and a recent visit by a vet doctor confirmed that the cow was ill and could only survive for another couple of weeks.[knowledge that suggestion is untrue]}THEN {‘the cow iS perfectly healthy; you need not worry about anythung’.[suggestion of fact]} is untrue {AND}{Zakariah[party to contract (2)]} does not believe it to be true. \n(5) IF {Zakariah[party to contract (2)]} made {‘the cow iS perfectly healthy; you need not worry about anythung’.[suggestion of fact]} to induce {Amatjit[party to contract (1)]} to enter into the contract THEN contract is obtained by fraud. {KHENG CHWEE LIAN v WONG TAK THONG [1983] 2 MLJ 320[322]}\n(6) IF (5) THEN contract is voidable at the option of {Amatjit[party to contract (1)]}{Section 19.1}.\n",
            "conclusion": "contract is voidable at the option of Amatjit by reason of fraud.\n"
        },
  {
            "id": "s16",
            "type": "Contract Law",
            "scenario": "In December 2008, Doctor Raju offered to sell his medical practice for RM150,000. Doctor Pritam having gone through the medical practice's income statement accepted the take over. The duration for the entire sale and purchase transaction was determined to be 4 months. During this time, Dr Raju fell ill and was unable to wok most of the time and due to this, his regular patients started going to other doctors. By the time Dr Pritam took over the medical practice, the income derived from it has fallen dramatically, and Dr Raju didn't thought it was necessary to inform Dr Pritam and therefore did not disclose this fact. Dr Pritam who now runs the practice feel's that he has been cheated and wishes to rescind the contract. ",
            "issue": "whether Dr Pritam can rescind the contract",
            "dceompose question": "1. Whether is the consent is free? \n 2.Whether there is a misrepreentation? \n 3. whethere is is a amount to breach of duty? \n 4. whether Dr Pritam is misled? \n",
            "analysis": "(1)IF agreement is made with free consent THEN it is a contract. {Section 10.1}\n(2) IF consent is not caused by misrepresentation THEN consent is free. {Section 14d}\n(3) IF {Doctor Raju[party to contract (1)]}'s {Dr Raju didn't thought it was necessary to inform Dr Pritam and therefore did not disclose this fact[non-disclosure of fact]} is an omission which amount to a breach of duty{AND} {Dr Raju didn't thought it was necessary to inform Dr Pritam and therefore did not disclose this fact[non-disclosure of fact]} has misled {Doctor Pritam[party to contract (2)]} THEN there is misrepresentation. {Section 18b}\n(4) GENERALLY, {Doctor Raju[party to contract (1)]} is not under a duty to disclose. {Section 17 Explanation}\n(5)  {HOWEVER} IF {his medical practice for RM150,000[representation of fact]} which was originally true has becomes untrue over the course of negotiation THEN {Doctor Raju[party to contract (1)]} has a duty to disclose {the income derived from it has fallen dramatically[the change of circumstances]}. {WITH v. O'FLANAGAN. [1934. W. 1358.] [1936] Ch. 575[582]}\n(6) IF (5) THEN {Doctor Raju[party to contract (1)]}'s {Dr Raju didn't thought it was necessary to inform Dr Pritam and therefore did not disclose this fact[non-disclosure of fact]} amount to breach of duty. \n(7) IF {Dr Raju didn't thought it was necessary to inform Dr Pritam and therefore did not disclose this fact[non-disclosure of fact]} has made {Doctor Pritam[party to contract (2)]} to think the medical practice it still the same as before income had fell drastically THEN it has misled {Doctor Pritam[party to contract (2)]}.\n(8) IF (6) AND (7) THEN agreement is voidable at the option of {Doctor Pritam[party to contract (2)]}. {Section 19.1}. \n",
            "conclusion": "Dr Pritam could rescind the contract if he wishes to"
        },
  {
            "id": "s17",
            "type": "Contract Law",
            "scenario": "Ali owns a padi harvesting tractor. In January he entered into a contract with Bakar in which he agreed to lease the machine to Bakar for two weeks at the beginning of March for RM3,000. Bakar paid Ali a deposit of RM500. In February, Ali realzes that it will be better to sell his tractor due to lack of storage at his premise. Ali than sold it to Chong who is aware of Ali's existing contract with Bakar. In March, Bakar realizes what has happened and calls Chong hoping that Chong will be able to allow him to use the tractor but Chong refuses. Bakar cannot obtain the machine anywhere else at such short notice and taces losing his entire crop if he is unable to harvest it within the next two weeks. ",
            "issue": "whether Bakar have any contractual right against Ali and Chong.\n",
            "dceompose question": "",
            "analysis": "(1) IF {Ali[party to first contract (1)]} entered into {Ali than sold it to Chong[second contract]} THEN it deprived him of the ability to perform his contractual obligations under {a contract with Bakar in which he agreed to lease the machine to Bakar for two weeks at the beginning of March for RM3,000[first contract]}. \n(2) IF (1) THEN {Ali[party to first contract (1)]} would be in breach of {a contract with Bakar in which he agreed to lease the machine to Bakar for two weeks at the beginning of March for RM3,000[first contract]}. \n(3) IF (2) THEN {Bakar[party to first contract (2)]} can sue {Ali[party to first contract (1)]} for damages. \n(4) IF {losing his entire crop if he is unable to harvest it within the next two weeks[direct loss]} is one that naturally arises in the usual course of things from the breach {OR} which parties knew to be likely to result from breach. {Section 74.1}\n(5) HOWEVER, {Bakar[party to first contract (2)]} is under a duty to take reasonable steps to mitigate loss. {Section 74.3 Explanation}{Kebatasan Timber Extraction Co v Chong Fah Sing (1969) 2 MLJ 6[8]}\n(6) SINCE {Bakar[party to first contract (2)]} has taken reasonable steps to {calls Chong hoping that Chong will be able to allow him to use the tractor but Chong refuses[mitigate loss]} {AND} he could not obtain the machine anywhere else on short notice THEN {Bakar[party to first contract (2)]} can recover {losing his entire crop if he is unable to harvest it within the next two weeks[direct loss]}. \n(7) SINCE {Bakar[party to first contract (2)]} is a third party in{Ali than sold it to Chong[second contract]} THEN he does not have rights against {Chong[party to second contract (2)]}. {Dunlop Pneumatic Tyre Company, Limited Appellants; v Selfridge and Company, Limited Respondents (1915) AC 847[864]}\n(8) {HOWEVER} IF {Chong[party to second contract (2)]} is aware of {a contract with Bakar in which he agreed to lease the machine to Bakar for two weeks at the beginning of March for RM3,000[first contract]} between {Bakar[party to first contract (2)]}{AND}{Ali[party to first contract (1)]} THEN {Bakar[party to first contract (2)]} could sue under tort for inducing a breach of contract. {British Motor Trade Association v Salvadori and Others[1949] Ch. 556[556]}.\n",
            "conclusion": "Bakar has contractual rights against Ali but not Chong but it is likely that Bakar could sue Chong under tort.\n"
        },
  {
            "id": "s18",
            "type": "Contract Law",
            "scenario": "Alpha Pty Ltd hires a machine from Beta Machines Ltd. The machine has been negligently maintained by Beta. It breaks down, and it will take Beta three weeks to repair the machine. A replacement can be hired, but none is available for a week. Normal losses amount to RM1,000 a day. [Alpha’s factory operates 7 days a week.] Alpha Pty Ltd has also lost a lucrative government contract worth a further RM50,000. The hire of the replacement machine is RM5,000 in total. What damages can Alpha Pty Ltd claim? a) $21,000 b) $71,000 c) $5,000 d) $12,000 e) $62,000 (remedies) \n",
            "issue": "what is the damages Alpha Pty Ltd is entitled to among the options of a,b,c,d and e",
            "dceompose question": "",
            "analysis": "(1) ACCORDING TO {Section 74.1}, {Alpha Pty Ltd[party suffering from breach]} is entitled to recover losses that naturally arises out of the breach of contract {OR} which parties knew to be likely to result from the beach. \n(2) IF (1) THEN {Alpha Pty Ltd[party suffering from breach]} can recover {Normal losses amount to RM1,000 a day[direct losses]} because it is a direct {AND} likely result of the breach of contract.\n(3) {HOWEVER} {Alpha Pty Ltd[party suffering from breach]} is under the duty to take reasonable steps to mitigate losses. {Section 74.3 Explanation} {Kebatasan Timber Extraction Co v Chong Fah Sing (1969) 2 MLJ 6[8]}\n(4) IF {A replacement can be hired[minimisation of loss]} is only available after a week THEN {Alpha Pty Ltd[party suffering from breach]} could claim {Normal losses amount to RM1,000 a day[direct losses]} for that week. {POPULAR INDUSTRIES LIMITED v EASTERN GARMENT MANUFACTURING SDN BHD [1989] 3 MLJ 360[366]}\n(5) IF (4) THEN {Alpha Pty Ltd[party suffering from breach]} can claim the damages of $7000 for {Normal losses amount to RM1,000 a day[direct losses]}. \n(6) IF {Alpha Pty Ltd[party suffering from breach]} has incurred {RM5,000[cost of minimising loss]} THEN {Alpha Pty Ltd[party suffering from breach]} can recover the additional costs.{Teh Wan Sang & Sons Sdn Bhd v See Teow Chuan (1984) 1 MLJ 130[133]}\n(7) IF {a lucrative government contract worth a further RM50,000[indirect losses]} is too remote THEN {Alpha Pty Ltd[party suffering from breach]} cannot claim damages for the loss. {Section 74.2}\n(8) IF {Beta Machines Ltd[party breaching the contract]} does not have actual knowledge of {a lucrative government contract[special circumstances]} THEN {Alpha Pty Ltd[party suffering from breach]} could not recover {RM50,000[indirect loss]}. {Victoria Laundry (Windsor) Ltd v Newman Industries Ltd (1949) 2 KB 528[530]}\n(9) IF (8) THEN {Alpha Pty Ltd[party suffering from breach]} can only recover $7000 {AND} $5000. \n(10) IF (9) THEN the recoverable damages will be option d.\n",
            "conclusion": " the damages Alpha Pty Ltd is entitled is option d, $12,000."
        },
  {
            "id": "s19",
            "type": "Contract Law",
            "scenario": "You are the legal compliance team who work for The Southern Cross Hospital which is in conflict with Zapit Ltd and wants your help resolving the following problem. The hospital hired an X-ray machine from Zapit Ltd. At the time of hiring, the hospital manager enquired about maintenance of the X-ray and was told that all maintenance was the responsibility of the hospital during the period of hire. At the same time the hospital manager was presented with a three page pre-typed document for signature. The manager only read parts of the document. One clause that the manager did not read said: “Any maintenance must be carried out by Zapit Ltd. Strict compliance with this condition is of the essence of the contract.” The hospital repaired the X-ray using its own hospital maintenance staff. The staff are highly skilled and able to carry out such repairs. When Zapit heard of the hospital’s actions it notified the hospital that the contract was terminated and the machine had to be returned immediately. The hospital is unable to replace the machine at short notice and wants to know if it has to return the X-ray \n",
            "issue": "whether Southern Cross Hospital has to return the X-ray",
            "dceompose question": "",
            "analysis": "(1) IF parties have intended for {was told that all maintenance was the responsibility of the hospital during the period of hire[oral statement]} to have contractual effect THEN it is a term that can be enforced.(Heilbut, Symons & Co v Buckleton [1913] AC 30) pg 43\n(2) IF {The Southern Cross Hospital[party to contract (1)]} did not express importance of {was told that all maintenance was the responsibility of the hospital during the period of hire[oral statement]} {AND} there is a long intervals between when statement is made and conclusion of contract {AND} {was told that all maintenance was the responsibility of the hospital during the period of hire[oral statement]} is not included in the written contract THEN it is likely that party did not intend it to be a term. (Bannerman v White (1861) 10 CBNS 844 (860))(Van Den Esschert v Chappell (1960) WAR 114 (116))(Routledge v McKay [1954] 1 All ER 855 at 859) \n(3) EVEN IF {was told that all maintenance was the responsibility of the hospital during the period of hire[oral statement]} is not a term, IF it is collateral contract THEN it is enforceable. \n(4) ACCORDING TO (Tan Swee Hoe Co Ltd v Ali Hussain Bros (1980) pg18), IF {was told that all maintenance was the responsibility of the hospital during the period of hire[oral statement]} induce {The Southern Cross Hospital[party to contract (1)]} to enter into the contract {AND} is supported by intention of the parties THEN {was told that all maintenance was the responsibility of the hospital during the period of hire[oral statement]} which was made outside of the written contract could form a collateral contract that has contractual effect. \n(5) IF {The Southern Cross Hospital[party to contract (1)]} has not expressed that they would only hire the machine if they don't have to rely on {Zapit Ltd[party to contract (2)]} for repair {AND} IF intention cannot be proven THEN there is no collateral contract. \n(6) IF {“Any maintenance must be carried out by Zapit Ltd. Strict compliance with this condition is of the essence of the contract.”[written term]} is incorporated into the contract THEN {was told that all maintenance was the responsibility of the hospital during the period of hire[oral statement]} cannot be enforced EVEN IF it is a collateral contract because there will be inconsistency. (Chase Perdana Bhd v Md Afendi bin Hamdan [2009] 6 MLJ 783 at 784)\n(7) SINCE {“Any maintenance must be carried out by Zapit Ltd. Strict compliance with this condition is of the essence of the contract.”[written term]} is incorporated by {At the same time the hospital manager was presented with a three page pre-typed document for signature. The manager only read parts of the document.[signature of document]} THEN {The Southern Cross Hospital[party to contract (1)]} will be bound by it even if he did not read it. (L'Estrange v Graucob Ltd [1934] 2 K.B. 394 at 395)\n(8) {HOWEVER} IF {was told that all maintenance was the responsibility of the hospital during the period of hire[oral statement]} amounted to  fraudulent misrepresentation THEN {The Southern Cross Hospital[party to contract (1)]} will not be bound by their signature. ( [1934] 2 K.B. 394 at 402)\n(9) IF (8) THEN {was told that all maintenance was the responsibility of the hospital during the period of hire[oral statement]} can be used to prove misrepresentation. (Evidence Act 1950 s.92(a)) \n(10) IF {The Southern Cross Hospital[party to contract (1)]} can prove that {was told that all maintenance was the responsibility of the hospital during the period of hire[oral statement]} is an untrue statement of fact by {Zapit Ltd[party to contract (2)]} who knows it to be untrue in order to induce {The Southern Cross Hospital[party to contract (1)]} to enter into the contract of hire {AND} did in fact induced them THEN fraudulent misrepresentation would be proven. {Section 17}{Section 17a}\n(11) IF fraudulent misrepresentation is proven THEN {The Southern Cross Hospital[party to contract (1)]} can insist the contract to be performed in the way as if {was told that all maintenance was the responsibility of the hospital during the period of hire[oral statement]} is true. {Section 19.2}\n(12) IF (11) THEN {The Southern Cross Hospital[party to contract (1)]} would not need to return the machine.\n",
            "conclusion": "Southern Cross Hospital does not have to return the X-ray provided that they could prove misrepresentation"
        },
  {
            "id": "s20",
            "type": "Contract Law",
            "scenario": "Bachhi Bhd (BB) purchased three earthmovers from Whitewash Sdn Bhd (WB) and used them on its worksite. After two and a half months, the former requested the latter to take back the said equipment on the basis that the said equipment were not suitable for the purpose for which they were bought. BB did this on the basis of a purported oral promise made by WSB when the sale was made. The alleged oral promise was to the effect that if the earthmovers were inappropriate, BB could return them without incurring any financial liability. WSB complied with BB's request and removed the earthmovers but remain adamant to the fact that BB should pay compensation for breach of contract. ",
            "issue": "whether BB have to pay compensation for breach of contract.",
            "dceompose question": "",
            "analysis": "(1) IF parties to contract have intended for {if the earthmovers were inappropriate, BB could return them without incurring any financial liability.[oral statement]} to have contractual effect THEN it is a term that can be enforced. (Heilbut, Symons & Co v Buckleton [1913] AC 30)pg 43\n(2) IF {Bachhi Bhd (BB)[party to contract (1)]} did not express the importance of {if the earthmovers were inappropriate, BB could return them without incurring any financial liability.[oral statement]} {AND} there is a long time interval between {if the earthmovers were inappropriate, BB could return them without incurring any financial liability.[oral statement]} and conclusion of contract {AND} {if the earthmovers were inappropriate, BB could return them without incurring any financial liability.[oral statement]} is not subsequently included in the written contract THEN it is likely that there is no intention.(Bannerman v White (1861) 10 CBNS 844 (860))(Van Den Esschert v Chappell (1960) WAR 114 (116))(Routledge v McKay [1954] 1 All ER 855 at 859) \n(3) IF {Bachhi Bhd (BB)[party to contract (1)]} has expressed importance of {if the earthmovers were inappropriate, BB could return them without incurring any financial liability.[oral statement]} {AND} had entered into contract upon hearing {if the earthmovers were inappropriate, BB could return them without incurring any financial liability.[oral statement]} THEN it is likely that there is intention  even if it is not included in the written contract. \n(4) IF intention is proven THEN {if the earthmovers were inappropriate, BB could return them without incurring any financial liability.[oral statement]} is a term. \n(5) IF intention is not proven THEN {if the earthmovers were inappropriate, BB could return them without incurring any financial liability.[oral statement]} is not a term. \n(6) EVEN IF {if the earthmovers were inappropriate, BB could return them without incurring any financial liability.[oral statement]} is not a term, IF it is a collateral contract THEN it is enforceable.\n(7) ACCORDING TO (Tan Swee Hoe Co Ltd v Ali Hussain Bros (1980) pg18), IF {if the earthmovers were inappropriate, BB could return them without incurring any financial liability.[oral statement]} had induced them into the contract {AND} is supported by intention of the parties THEN {if the earthmovers were inappropriate, BB could return them without incurring any financial liability.[oral statement]} which was made outside of the written contract could form a collateral contract that has contractual effect. \n(8) {HOWEVER} (7) is ONLY IF {if the earthmovers were inappropriate, BB could return them without incurring any financial liability.[oral statement]} does not contradict the written contract. (Chase Perdana Bhd v Md Afendi bin Hamdan [2009] 6 MLJ 783 at 784)\n(9) IF {if the earthmovers were inappropriate, BB could return them without incurring any financial liability.[oral statement]} is a term {OR} {if the earthmovers were inappropriate, BB could return them without incurring any financial liability.[oral statement]} forms a collateral contract THEN {Bachhi Bhd (BB)[party to contract (1)]} can enforce it. \n(10) IF {if the earthmovers were inappropriate, BB could return them without incurring any financial liability.[oral statement]} is not a term {OR} a collateral contract THEN {Bachhi Bhd (BB)[party to contract (1)]} cannot enforce it. \n(11) IF (10)THEN {Bachhi Bhd (BB)[party to contract (1)]} does not have to pay financial compensation.\n(12) IF (11) THEN {Bachhi Bhd (BB)[party to contract (1)]} have to pay financial compensation.\n",
            "conclusion": "BB does not have to pay compensation for breach of contract provided that oral statement is a term or it forms a collateral contract."
        },
  {
            "id": "s21",
            "type": "Australia Social Act",
            "scenario": " I’ve got a kid called Bob, who was born in 2000. He’s a lazy kid. He’s got no job, he just sits around in my house all day. I give him everything",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If the child is above 16 and below 22? \nIf the child is wholly or substantially dependent on adult?\nIf the child’s income does not exceed 6403 in the financial year? \n",
            "analysis": "Person X has a kid named Bob who is 21 years old thus the relevant provision would be s.5(4).\nAccording to s.5(4), a person who has reached 16 but is under 22 would be considered as a dependent child of another person provided that the young person is wholly or substantially dependent on another and if the young person’s income in the financial year is not more than $6,403.\nAs person X mentioned that Bob does not have a job and person X provides Bob with everything, it is understood that Bob is wholly dependent on person X and is not in receipt of income\nHence the two conditions that was mentioned in s.(4) is fulfilled.\n",
            "conclusion": "Therefore, Bob is a dependent child of person X. "
        },
  {
            "id": "s22",
            "type": "Australia Social Act",
            "scenario": "My daughter Lizzie was born in 2005. I’m so worried about her. She’s dropped out of school. She says she wants to be independent, but I still pay all her bills and put a roof over her head. She’s so ungrateful! She thinks she’s an adult now, but she only makes $110 a week at her job. That’s not enough to live on.",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If adult is legally responsible for day to day care, welfare and development of the child and the child is in the adult’s care\nIf the child is not a dependent child of someone else and is wholly and substantially in the care of the adult \nIf the child is in full-time education\nIf the child is in receipt of income which exceeds 107.70 per week \n",
            "analysis": "Person X has a daughter named Lizzie who is born in 2005, this means that she would be 16 if she is born before July 2005 and she would be under 16 if she is born after July 2005. In the scenario that Lizzie has reached the age of 16, the relevant provision would be s.5(4). \nAccordingly, Lizzie can be a dependent child if she is wholly or substantially dependent on person X  and if her income in financial year does not exceed $6403. \nAs person X  is the one paying for Lizzie’s bill and putting a roof over Lizzie’s head, Lizzie is substantially dependent on person X. Moreover, Lizzie only earns $110 a week, meaning that her yearly income is $ 5720 which does not exceed $6403. Therefore, Lizzie is a dependent child under s.5(4). \nAlternatively, in the scenario that Lizzie has not reached the age of 16, the relevant provision is s.5(2) and s.5(3). \nUnder s.5(2), Lizzie will be a dependent child if person X is legally responsible for day to day care, welfare and development of Lizzie, if Lizzie is not a dependent child of someone else and if person X is wholly or substantially in the mother’s care. Lizzie fulfilled all the three requirements as there is no mention that there is another adult whom Lizzie is dependent on except for person X, person X is also the mother of Lizzie thus she is legally responsible for Lizzie, and Lizzie is also substantially dependent on person X since her bills payment and house are provided by person X. \nHowever, s.5(3) states that a person cannot be a dependent child if they’re not in full time education and if they’re in receipt of an income and if said income exceeds $107.70 per week. \n",
            "conclusion": "With this, Lizzie is not a dependent child because she is not in full time education and she is in receipt of an income of $110  per week which exceed the required amount of  $107.70.   "
        },
  {
            "id": "s23",
            "type": "Australia Social Act",
            "scenario": "My child Jasmine is 15 this year. She’s a star athlete and earns income from tennis coaching. She’s so dedicated. I’ve had to speak with her teacher to make sure school doesn’t clash with her tennis commitments, so she’s only attending part-time now.\n",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If adult is legally responsible for day to day care, welfare and development of the child and the child is in the adult’s care\nIf the child is not a dependent child of someone else and is wholly and substantially in the care of the adult \nIf the child is in full-time education\nIf the child is in receipt of income which exceeds 107.70 per week \n",
            "analysis": "Person X has a child named Jasmine who is 15 years old thus the relevant sections is s.5(2) and s.5(3). \nUnder s.5(2), a person will be a dependent child if the adult is legally responsible for the day-to-day care, welfare and development of the child, if the child is not a dependent child is someone else and if the child is wholly or substantially in the adult’s care. In this scenario,\nJasmine fulfilled the first two conditions as person X is Jasmine’s mother thus she is legally responsible for Jasmine and there is no mention of another adult whom Jasmine is dependent on. \nHowever, the question is silent on whether Jasmine is wholly or substantially dependent on person X as it does not mention where Jasmine live, who pays for Jasmine but it could be assumed that Jasmine is dependent on person X to some extent as Jasmine still relied on person X to communicate with the teacher from school. \nOn the assumption that Jasmine does fulfils the three requirements under s.5(2), the next step would be to look at s.5(3) which states that a child under 16 cannot be a dependent child if the person is not in full time education and if the person is in receipt of an income which exceeds $107.70 per week. \nWhile Jasmine is not in full time education and has income from tennis coaching, it is unsure as to whether her income exceeds $107.70. \nIf Jasmine’s income exceed $107.70 per week, she will not be a dependent child but if Jasmine’s income does not exceed $107.70 per week, she will be a dependent child. \n",
            "conclusion": "Therefore, Jasmine will be a dependent child provided that she is in whole or substantial care of person X. Additionally, if she is not in receipt of income which exceed $107.70 per week. \n"
        },
  {
            "id": "s24",
            "type": "Australia Social Act",
            "scenario": "My wife and I have an adopted daughter, Willow. She’s just turned 17. My wife is the breadwinner of the household and makes big money working as a management consultant at McLoitte. I don’t understand all that myself, but she financially supports our family and I’m happy to take care of Willow while she’s off working late. Somebody’s got to make the meals and go to the PTA meetings.",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If the child is above 16 and below 22? \nIf the child is wholly or substantially dependent on adult?\nIf the child’s income does not exceed 6403 in the financial year? \n",
            "analysis": "\nAs person X and their wife’s daughter, Willow, is 17 years old, the relevant section would be s.5(4). \nUnder s.5(4), a person who is above 16 but under 22 would be a dependent child if they are wholly or substantially dependent on another person and if their income in financial year does not exceed $6403. \nAs person X take cares of Willow, he cooks lunch and go to PTA’s meeting, willow is substantially dependent on person X thus fulfilling the first requirement, but the question does not mention willow’s income in financial year thus if Willow’s income in financial year does not exceed $6403, she will be a dependent child of person X. \nAlternatively, if Willow’s income in financial year does exceed $6403, she will not be a dependent child of person X. \nPerson X’s wife is the breadwinner of the household, she take cares of Willow financially, thus Willow is substantially dependent on person X’s wife and could be a dependent child of the wife. \n",
            "conclusion": "Therefore, if willow’s income in financial year does not exceed $6403, willow is a dependent child of person X’s wife and if Willow’s income in financial year does exceed $6403, willow will not be a dependent child of person X’s wife."
        },
  {
            "id": "s25",
            "type": "Australia Social Act",
            "scenario": " I have two kids, Phoebe and Andrew. I have custody over both kids and they are wholly in my care. Phoebe is 13 and Andrew is a year older. Phoebe studies part-time and Andrew studies full-time. Phoebe is a young upstart with her own online business and earns somewhere between $100 and $150 a week. Andrew should learn from his sister and do something productive with his time.\n",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If adult is legally responsible for day to day care, welfare and development of the child and the child is in the adult’s care\nIf the child is not a dependent child of someone else and is wholly and substantially in the care of the adult \nIf the child is in full-time education\nIf the child is in receipt of income which exceeds 107.70 per week \n",
            "analysis": "Person X has two kids, Phoebe and Andrew, who is both under 16 thus the relevant sections would be s.5(2) and s.5(3). \nUnder s.5(2,) a person will be a dependent child if the adult is legally responsible for the day-to-day care, welfare and development of the child, if the child is not a dependent child is someone else and if the child is wholly or substantially in the adult’s care. \nThere is no mention of another adult whom the kids are dependent on and the question mentioned that person X has custody over both the kids thus person X is legally responsible of both Phoebe and Andrew. \nMoreover, both of the kids are wholly in the care of person X, therefore they can be a dependent child under s.5(2).\nThe next section to look at is s.5(3) under which states that a child under 16 cannot be a dependent child if the person is not in full time education and if the person is in receipt of an income which exceeds $107.70 per week. \nFor Phoebe, she is not in full time education and is in receipt of an income between the rate of $100 to $150 per week, thus if at the particular time, Phoebe has an income exceeding $107.70 per week then she is not a dependent child of person X. \nAlternatively, if, at the particular time, Phoebe’s income does not exceed $107.70 per week then she will be a dependent child of person X. \nFor Andrew, he studied full time and is likely that he is not in receipt of an income as person X says that they wish he would do something productive with his time, implying that he does not. \n",
            "conclusion": "Therefore, Andrew is a dependent child of person X. "
        },
  {
            "id": "s26",
            "type": "Australia Social Act",
            "scenario": " My 18-year-old kid is mostly couch-surfing at my house these days. He makes $3,000 p/year doing random odd jobs in the neighbourhood. I don’t know how he gets by, but I hear his friends bail him out a lot and he just floats between houses. I don’t know if I can really say that he is in my care, although he does still get financial support from me.",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If the child is above 16 and below 22? \nIf the child is wholly or substantially dependent on adult?\nIf the child’s income does not exceed 6403 in the financial year? \n",
            "analysis": "Person X has a kid who is 18 years old thus the relevant section would be s.5(4) under which a person who is above 16 but under 22 would be a dependent child if they are wholly or substantially dependent on another person and if their income in financial year does not exceed $6403.\n In this scenario, the 18 years old earns an income of $3000 per year which does not exceed then required amount of $6403, he could be a dependent child of person X. \nHowever, the question does not mention whether he is substantially or wholly in person X care because person X does not live with the kid which implies that person X is not responsible for the kid’s day to day care.\n However, person X does provide financial support to the kid to which he is dependent on since $3000 per year is insufficient to get by. \n",
            "conclusion": "If the financial support amount to be being in substantial care of person X then the kid is a dependent child of person X"
        },
  {
            "id": "s27",
            "type": "Australia Social Act",
            "scenario": "My 24-year-old is still at home and entirely dependent on me. When I was younger, I dreamed of seeing the world, of leaving the malaise of my endless suburban existence to find myself. I was my own person: I had my own desires, my own drive, my own sense of purpose. Everything changed when Chad came along. I can’t sleep anymore because he has turned my bedroom into a gaming room. All my life savings have gone into Chad’s Fortnite purchases. I just want to be free of him. I fear that we will grow old together, that all I shall hear through the decades of his middle age will be the sound of virtual machine guns to haunt my dreams at night. Centrelink, if you are listening to me, please help me.\n",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If the child is above 16 and below 22? \nIf the child is wholly or substantially dependent on adult?\nIf the child’s income does not exceed 6403 in the financial year? \n",
            "analysis": "Person X has a child who is 24 years old, neither s.5(2) or s.5(4) is relevant in this scenario \nbecause the child is above the age of 22. \n",
            "conclusion": "Hence, the child cannot be a dependent child of person X."
        },
  {
            "id": "s28",
            "type": "Australia Social Act",
            "scenario": "Hi, I have a 3 year old niece. Last month, her parents got COVID and died. My niece lives with me because my brother adopted her and she has no other family. I do my best to bring her up like my brother and sister in law were doing before they died. I took out a bank loan to make sure I have enough money to pay for all the expenses, including kindie.",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If adult is legally responsible for day to day care, welfare and development of the child and the child is in the adult’s care\nIf the child is not a dependent child of someone else and is wholly and substantially in the care of the adult \nIf the child is in full-time education\nIf the child is in receipt of income which exceeds 107.70 per week \n",
            "analysis": "Person X has a niece who is 3 years old thus the relevant section would be s.5(2) and s.5(3). Under s.5(2),  \na person will be a dependent child if the adult is legally responsible for the day-to-day care, welfare and development of the child, if the child is not a dependent child is someone else and if the child is wholly or substantially in the adult’s care. \nThe niece is not a dependent child of another as she has no other family member and the niece is wholly in the care of person X since she lives with person X who try to bring her up like her parents and even took a loan to pay for the niece’s expenses. \nHowever, the question is unclear as to whether person X is legally responsible for the niece as there is no mention of custody, if person X is legally responsible for the niece then the niece could be a dependent child of person X. \nAlternatively, if person X is not legally responsible for the niece then the niece would not be a dependent child of person X. \nThe next section to look at is s.5(3) under which states that a child under 16 cannot be a dependent child if the person is not in full time education and if the person is in receipt of an income which exceeds $107.70 per week. \nPerson X pay for the niece to attend kindergarten, this means that the niece is in full time education. Additionally, it is unlikely that the niece is in receipt of any income as she is merely 3 years old. \n",
            "conclusion": " Therefore, the niece fulfils the two requirement under s.5(3) and could be the dependent child of person X. \n"
        },
  {
            "id": "s29",
            "type": "Australia Social Act",
            "scenario": "Hi, I am a single mother of a 17 year old daughter. She has ASD. My family is a big support for me. During the week, she shadows my sister who runs a hair salon. My sister pays her $300 a week to sweep up hair, make appointments for clients and do odd jobs at the salon, in return for training her to cut and style hair.\n",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If the child is above 16 and below 22? \nIf the child is wholly or substantially dependent on adult?\nIf the child’s income does not exceed 6403 in the financial year? \n",
            "analysis": "Person X has a daughter who is 17 years old thus the relevant section would be s.5(4) under which a person who is above 16 but under 22 would be a dependent child if they are wholly or substantially dependent on another person and if their income in financial year does not exceed $6403. \nThe question does not mention whether the daughter is wholly or substantially in the care of person X but regardless, the daughter could not be a dependent child of person X because the daughter is shadowing in the saloon of person X’s sister who pays her $300 per week which amounts to $15,500 per year, exceeding the amount of $6403.\n",
            "conclusion": " Thus, the daughter cannot be a dependent child of person X. \n"
        },
  {
            "id": "s30",
            "type": "Australia Social Act",
            "scenario": " Hi, My only son was born on 19 July 2004. He lives with me and since last year, he has been attending Melbourne Grammar School. To have some pocket money, he is a social media influencer. He earns $25 per video and he makes 3 videos a week. The videos are so funny!!!!\n",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": " If the child is above 16 and below 22? \nIf the child is wholly or substantially dependent on adult?\nIf the child’s income does not exceed 6403 in the financial year? \n",
            "analysis": "Person X has a son who is 17 years old thus the relevant section is s.5(4) under which a person who is above 16 but under 22 would be a dependent child if they are wholly or substantially dependent on another person and if their income in financial year does not exceed $6403. \nPerson X mention that she lives with her 17 years old son, which means that it is likely that the son is wholly or substantially dependent on person X. \nThe 17 years old son makes 3 videos per week to earn some pocket money, this means that he earns $75 per week so his income in the financial year is at most $3,900 which does not exceed the amount of $6403. \n",
            "conclusion": "Therefore, the son is a dependent child of X. "
        },
  {
            "id": "s31",
            "type": "Australia Social Act",
            "scenario": " Hi, I have a 15 year old son. he boards at Caulfield Grammar School. I work two jobs to pay his school fees, they are really expensive but i am so happy with the education that he gets. He is really good at footy and I think he will be a future number 1 draft pick. On Saturdays, hes a footy umpire for U8s and he says he makes around $100.",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If adult is legally responsible for day to day care, welfare and development of the child and the child is in the adult’s care\nIf the child is not a dependent child of someone else and is wholly and substantially in the care of the adult \nIf the child is in full-time education\nIf the child is in receipt of income which exceeds 107.70 per week \n\n",
            "analysis": "Person X has a son who is 15 years old thus the relevant section would be s.5(2) and s.5(3).  \nUnder s.5(2), a person will be a dependent child if the adult is legally responsible for the day-to-day care, welfare and development of the child, if the child is not a dependent child of someone else and if the child is wholly or substantially in the adult’s care. \nAs there is no mention of another adult, it is likely that the son is not a dependent child of another person and it is also likely that the son is substantially in person X’s care because he is dependent on person X to pay for his boarding school fees. \nMoreover, person X is the parent of the 15 years old kid thus, they are legally responsible for the kid. With this, the three requirements are fulfilled and the kid could be a dependent child of person X. \nThe next section to look at is s.5(3) under which states that a child under 16 cannot be a dependent child if the person is not in full time education and if the person is in receipt of an income which exceeds $107.70 per week. \nAs the son goes to a boarding school it is likely that he is in full time education. \nThe son also receives an income of $100 on Saturdays each week which does not exceed $107.70 per week\n",
            "conclusion": " thus he could be a dependent child of person X. \n"
        },
  {
            "id": "s32",
            "type": "Australia Social Act",
            "scenario": "Hi, My 20 year old son has ASD. This year, the NDIS found him assisted living accommodation with friends and support workers, it has been great for him. i still pay for most of his expenses, including TAFE. Money is tight so I hope once COVID is over that he can find some work in a cafe, he loves making coffees.\n",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If the child is above 16 and below 22? \nIf the child is wholly or substantially dependent on adult?\nIf the child’s income does not exceed 6403 in the financial year? \n",
            "analysis": "Person X has a son who is 20 years old thus the relevant section would be s.5(4) under which a person who is above 16 but under 22 would be a dependent child if they are wholly or substantially dependent on another person and if their income in financial year does not exceed $6403.\n It is mentioned that the son live in assisted living accommodation with friends and support worker, not with person X thus person X does not take care of the son’s daily life, but she pays for most of his expenses thus the son still depends on person X financially.  With this, the son is substantially dependent on person X. \nAs person X mention that money is tight  and she hopes that her son find a job once COVID is over, it implies that the son does not have a job and is not in receipt of an income, \nhence his income does not exceed $6403 per year. \n",
            "conclusion": "With this, the son could be dependent child of person X. "
        },
  {
            "id": "s33",
            "type": "Australia Social Act",
            "scenario": " I fought with my son today. He’s 15, so I guess he’s at a rebellious age, but he actually said that he wanted to go and live with his father today! Even though we’ve never formally separated, I’ve been estranged from my husband for a very long time and we haven’t been in contact. But today I found out that not only has he been secretly talking to my son, he’s also been sending him money for school and other expenses!",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If adult is legally responsible for day to day care, welfare and development of the child and the child is in the adult’s care\nIf the child is not a dependent child of someone else and is wholly and substantially in the care of the adult \nIf the child is in full-time education\nIf the child is in receipt of income which exceeds 107.70 per week \n",
            "analysis": "Person X has a son who is 15 years old thus the relevant sections would be s.5(2) and s.5(3). \nUnder s.5(2), a person will be a dependent child if the adult is legally responsible for the day-to-day care, welfare and development of the child, if the child is not a dependent child of someone else and if the child is wholly or substantially in the adult’s care. \nAs person X is the mother of the kid who lives with him and has not formally divorced her estranged husband, she is jointly legally responsible for the day to day care, welfare and development of the son with her estranged husband, \nthere is no mention that the son is a dependent child of another adult other than the parents and it is also likely that the son is substantially in her care since she takes care of his daily life, thus the son could be a dependent child. \nThe next section to look at is s.5(3) under which states that a child under 16 cannot be a dependent child if the person is not in full time education and if the person is in receipt of an income which exceeds $107.70 per week. \nAs the son goes to school and depends on the father for expenses, it is likely that he is in full time education and not in receipt of any income. \n",
            "conclusion": "With this, the son is a dependent child. "
        },
  {
            "id": "s34",
            "type": "Australia Social Act",
            "scenario": "I’m 23 years old and I have a 10 year old sister. She’s the cutest, sweetest child you will ever meet. I’ve been looking after her on my own ever since our parents passed away in a car accident last year. I make sure she’s doing well at school and can still grow up happily, despite everything that’s happened. I don’t want to lose her, because she’s the only thing I have left now…\n",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If adult is legally responsible for day to day care, welfare and development of the child and the child is in the adult’s care\nIf the child is not a dependent child of someone else and is wholly and substantially in the care of the adult \nIf the child is in full-time education\nIf the child is in receipt of income which exceeds 107.70 per week \n",
            "analysis": "Person X has a sister who is 10 years old thus the relevant section would be s.5(2) and s.5(3). \nUnder s.5(2)  a person will be a dependent child if the adult is legally responsible for the day-to-day care, welfare and development of the child, if the child is not a dependent child of someone else and if the child is wholly or substantially in the adult’s care. \nAs there is no mention of another adult, it is likely that the sister is not a dependent child if someone else, and since person X has been looking after the sister since their parents have passed away, by making sure she does well in school and grows up happy, person X is legally responsible for the day to day care, welfare and development of the child and the child is wholly in person X’s care. \nAs all three requirements is fulfilled, the sister could be a dependent child. ( do we talk about custody here for the legally responsible part) \nThe next section to look at is s.5(3) under which states that a child under 16 cannot be a dependent child if the person is not in full time education and  if the person is in receipt of an income which exceeds $107.70 per week. \nThe question implies that the sister attend school full time because person X ensures she does well in school and there is also no mention that the sister is in receipt of any income thus her income per week does not exceeds $107.70. \n",
            "conclusion": "Therefore, the sister is a dependent child of person X. "
        },
  {
            "id": "s35",
            "type": "Australia Social Act",
            "scenario": " I’m seventeen years old this year. I don’t have a good relationship with my parents, so I rented my own apartment last year and moved out. Even though they send me money each month, it’s not enough to even pay rent. Thankfully I can take on freelance programming jobs to make ends meet, even though the income isn’t very stable. Last year I only made 15k, but this year I’ve already made double that amount. \n",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If the child is above 16 and below 22? \nIf the child is wholly or substantially dependent on adult?\nIf the child’s income does not exceed 6403 in the financial year? \n",
            "analysis": "Person X is 17 years old thus the relevant sections would be s.5(4) under which a person who is above 16 but under 22 would be a dependent child if they are wholly or substantially dependent on another person and if their income in financial year does not exceed $6403. \nAlthough person X no longer lives with her parents, they still provide her financial support each month but since the money is not sufficient to pay for her rent,\n person X has to work in order to support herself thus it cannot be said that person X is substantially dependent on her parents as she is the one supporting herself. \nMoreover, person X has made $30k in this financial year which exceeds $6403 \n",
            "conclusion": "Therefore person X cannot be a dependent child. \n"
        },
  {
            "id": "s36",
            "type": "Australia Social Act",
            "scenario": "My son was born in 2002. He’s always been an independent child and even though he lives with me, he insists on paying me rent every month. He says that he can afford it, but I’d rather he just keep the money to save up for a house. His job does pay well though, I heard he earnt over 30k this year...\n",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If the child is above 16 and below 22? \nIf the child is wholly or substantially dependent on adult?\nIf the child’s income does not exceed 6403 in the financial year? \n",
            "analysis": "Person X has a son who is 19 years old thus the relevant sections is s.5(4) under which a person who is above 16 but under 22 would be a dependent child if they are wholly or substantially dependent on another person and if their income in financial year does not exceed $6403.\n As was mentioned, the son is an independent child who pays for person X rent everyone month despite living with person X thus the son is not wholly or substantially dependent on person X. \nMoreover, the son earns over $30k in this financial year, exceeding $6403 \n",
            "conclusion": "thus he cannot be a dependent child of person X. "
        },
  {
            "id": "s37",
            "type": "Australia Social Act",
            "scenario": "My daughter Samantha is super amazing! Because she’s so cute I made an instagram account for her when she was younger and she now has over 1 million subscribers! Even though she hasn’t even had her 12th birthday yet, she’s already earning over 100k a year with instagram sponsorships! I think that she should drop out of school so that she can go to more influencer events and make more money, but her dad says she must at least graduate high school. For now I act as her manager and look after every aspect of her life. \n",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If adult is legally responsible for day to day care, welfare and development of the child and the child is in the adult’s care\nIf the child is not a dependent child of someone else and is wholly and substantially in the care of the adult \nIf the child is in full-time education\nIf the child is in receipt of income which exceeds 107.70 per week \n",
            "analysis": "Person X has a daughter named Samantha who is under 12 years old thus the relevant sections would be s.5(2) and s.5(3). \nUnder s.5(2)  a person will be a dependent child if the adult is legally responsible for the day-to-day care, welfare and development of the child, if the child is not a dependent child of someone else and if the child is wholly or substantially in the adult’s care. \nThere is no mention that there is any other adult thus it is unlikely that Samantha is a dependent child of another adult and since person X is the parent of Samantha who looks after every aspect of her life, person X is legally responsible for the day to day care, welfare and development of Samantha and also takes whole or substantial care of Samantha. \nWith this, Samantha could be a dependent child. \nThe next section to look at is s.5(3) under which states that a child under 16 cannot be a dependent child if the person is not in full time education and if the person is in receipt of an income which exceeds $107.70 per week. \nAlthough Samantha received an income of over 100k per year which exceeds $107.70 per week, she is still in full time education as the dad has refused to let her dropped out and has said that she must graduate high school. \n",
            "conclusion": "Therefore, Samantha is a dependent child.  \n"
        },
  {
            "id": "s38",
            "type": "Australia Social Act",
            "scenario": "My mom wants to claim me as a dependent child. I still live at home with her and still haven’t turned 22, but I started working full time after graduating from high school and I earn more than her. I found a decent job and earn around 70k each year. \n",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If the child is above 16 and below 22? \nIf the child is wholly or substantially dependent on adult?\nIf the child’s income does not exceed 6403 in the financial year? \n",
            "analysis": "Person X is under 22 but has graduated high school, meaning that she is above 16 but below 22 thus the relevant sections would be s.5(4) under which a person who is above 16 but under 22 would be a dependent child if they are wholly or substantially dependent on another person and if their income in financial year does not exceed $6403. \nAlthough person X lives with her mother, she earns more than her mother thus she is not wholly or substantially dependent on her mother. \nMoreover, person X earns around 70k per year which exceeds $6403. \n",
            "conclusion": "Therefore, person X is not a dependent child. "
        },
  {
            "id": "s39",
            "type": "Australia Social Act",
            "scenario": " I have an older sister who is still wholly dependent on my parents. She’s 37 years old but unemployed and lives with my parents. She has a college degree but she can’t go anywhere by herself and needs my parents to take her. ",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If the child is above 16 and below 22? \nIf the child is wholly or substantially dependent on adult?\nIf the child’s income does not exceed 6403 in the financial year? \n",
            "analysis": "Person X has a sister who is 37 years old who is wholly dependent on their parents. \nSince the sister is already above 22 years old she could not claim to be a dependent child under s.5(2) or s.5(3). \n",
            "conclusion": "Thus, person X’s sister is not a dependent child. "
        },
  {
            "id": "s40",
            "type": "Australia Social Act",
            "scenario": " Hello, I have a 14 year old son, who lives with his grandparents in Sydney. My parents are retired and don’t work. I send them money each month for his living expenses, which includes tuition for school. \n",
            "issue": "Is the child dependent child under Australia  Social Policy Law?",
            "dceompose question": "If adult is legally responsible for day to day care, welfare and development of the child and the child is in the adult’s care\nIf the child is not a dependent child of someone else and is wholly and substantially in the care of the adult \nIf the child is in full-time education\nIf the child is in receipt of income which exceeds 107.70 per week \n",
            "analysis": "Person X has a son who is 14 years old thus the relevant sections would be s.5(2) and s.5(3). \nUnder s.5(2)  a person will be a dependent child if the adult is legally responsible for the day-to-day care, welfare and development of the child, if the child is not a dependent child of someone else and if the child is wholly or substantially in the adult’s care. \nAs person X is the parent of the child, they are legally responsible for the day to day care, welfare and development of the child, and the child is also substantially in person X’s care as they are the one who pays for his living expenses including his tuition fees. \nHowever, the son currently lives with his grandparents so he is in substantial care of his grandparents and could be a dependent child of his grandparents but since the child’s parent is still alive it is likely that person X would be the one who is legally responsible for the child rather than the grandparents. \nTherefore, the son could be a dependent child.\nThe next section to look at is s.5(3) under which states that a child under 16 cannot be a dependent child if the person is not in full time education and if the person is in receipt of an income which exceeds $107.70 per week. \nAs person X pays for the son’s living expenses and school fees, it is likely that the son attend school full time and does not earn income for himself,\n",
            "conclusion": "therefore the son is a dependent child of person X. \n"
        }

]

